@dannielshalev 

I created same module on my machine and applied the same Terraform Configuration, I am not facing the issue you are facing. Please check your APIC Audit logs for the deletion of the objects you are creating using Terraform. I think the objects are deleted and that's why Terraform is not able to find them in next run.


Here is the output from my Terraform module, i have used the same code you have pasted above,

```
M14-NiravK:test_leaf_prof nirav.katarmal$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.leaf101_102.aci_leaf_interface_profile.interface_profile will be created
  + resource "aci_leaf_interface_profile" "interface_profile" {
      + annotation  = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "101-102"
      + name_alias  = (known after apply)
    }

  # module.leaf101_102.aci_leaf_profile.leaf_profile will be created
  + resource "aci_leaf_profile" "leaf_profile" {
      + annotation                   = (known after apply)
      + description                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "terrafrom-101-102_LfProf"
      + name_alias                   = (known after apply)
      + relation_infra_rs_acc_port_p = (known after apply)
    }

  # module.leaf101_102.aci_node_block.check["101"] will be created
  + resource "aci_node_block" "check" {
      + annotation            = (known after apply)
      + description           = (known after apply)
      + from_                 = "101"
      + id                    = (known after apply)
      + name                  = "101"
      + name_alias            = (known after apply)
      + switch_association_dn = (known after apply)
      + to_                   = "101"
    }

  # module.leaf101_102.aci_node_block.check["102"] will be created
  + resource "aci_node_block" "check" {
      + annotation            = (known after apply)
      + description           = (known after apply)
      + from_                 = "102"
      + id                    = (known after apply)
      + name                  = "102"
      + name_alias            = (known after apply)
      + switch_association_dn = (known after apply)
      + to_                   = "102"
    }

  # module.leaf101_102.aci_switch_association.switch_association will be created
  + resource "aci_switch_association" "switch_association" {
      + annotation              = (known after apply)
      + description             = (known after apply)
      + id                      = (known after apply)
      + leaf_profile_dn         = (known after apply)
      + name                    = "terrafrom-101-102_LfProf"
      + name_alias              = (known after apply)
      + switch_association_type = "range"
    }

  # module.leaf103.aci_leaf_interface_profile.interface_profile will be created
  + resource "aci_leaf_interface_profile" "interface_profile" {
      + annotation  = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "103"
      + name_alias  = (known after apply)
    }

  # module.leaf103.aci_leaf_profile.leaf_profile will be created
  + resource "aci_leaf_profile" "leaf_profile" {
      + annotation                   = (known after apply)
      + description                  = (known after apply)
      + id                           = (known after apply)
      + name                         = "terrafrom-103_LfProf"
      + name_alias                   = (known after apply)
      + relation_infra_rs_acc_port_p = (known after apply)
    }

  # module.leaf103.aci_node_block.check["103"] will be created
  + resource "aci_node_block" "check" {
      + annotation            = (known after apply)
      + description           = (known after apply)
      + from_                 = "103"
      + id                    = (known after apply)
      + name                  = "103"
      + name_alias            = (known after apply)
      + switch_association_dn = (known after apply)
      + to_                   = "103"
    }

  # module.leaf103.aci_switch_association.switch_association will be created
  + resource "aci_switch_association" "switch_association" {
      + annotation              = (known after apply)
      + description             = (known after apply)
      + id                      = (known after apply)
      + leaf_profile_dn         = (known after apply)
      + name                    = "terrafrom-103_LfProf"
      + name_alias              = (known after apply)
      + switch_association_type = "range"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.leaf101_102.aci_leaf_interface_profile.interface_profile: Creating...
module.leaf103.aci_leaf_interface_profile.interface_profile: Creating...
module.leaf101_102.aci_leaf_interface_profile.interface_profile: Creation complete after 0s [id=uni/infra/accportprof-101-102]
module.leaf101_102.aci_leaf_profile.leaf_profile: Creating...
module.leaf103.aci_leaf_interface_profile.interface_profile: Creation complete after 0s [id=uni/infra/accportprof-103]
module.leaf103.aci_leaf_profile.leaf_profile: Creating...
module.leaf101_102.aci_leaf_profile.leaf_profile: Creation complete after 1s [id=uni/infra/nprof-terrafrom-101-102_LfProf]
module.leaf101_102.aci_switch_association.switch_association: Creating...
module.leaf101_102.aci_switch_association.switch_association: Creation complete after 0s [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range]
module.leaf101_102.aci_node_block.check["102"]: Creating...
module.leaf101_102.aci_node_block.check["101"]: Creating...
module.leaf101_102.aci_node_block.check["101"]: Creation complete after 0s [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range/nodeblk-101]
module.leaf101_102.aci_node_block.check["102"]: Creation complete after 1s [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range/nodeblk-102]
module.leaf103.aci_leaf_profile.leaf_profile: Creation complete after 2s [id=uni/infra/nprof-terrafrom-103_LfProf]
module.leaf103.aci_switch_association.switch_association: Creating...
module.leaf103.aci_switch_association.switch_association: Creation complete after 0s [id=uni/infra/nprof-terrafrom-103_LfProf/leaves-terrafrom-103_LfProf-typ-range]
module.leaf103.aci_node_block.check["103"]: Creating...
module.leaf103.aci_node_block.check["103"]: Creation complete after 0s [id=uni/infra/nprof-terrafrom-103_LfProf/leaves-terrafrom-103_LfProf-typ-range/nodeblk-103]

Apply complete! Resources: 9 added, 0 changed, 0 destroyed.
M14-NiravK:test_leaf_prof nirav.katarmal$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.leaf101_102.aci_leaf_interface_profile.interface_profile: Refreshing state... [id=uni/infra/accportprof-101-102]
module.leaf103.aci_leaf_interface_profile.interface_profile: Refreshing state... [id=uni/infra/accportprof-103]
module.leaf101_102.aci_leaf_profile.leaf_profile: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf]
module.leaf103.aci_leaf_profile.leaf_profile: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf]
module.leaf101_102.aci_switch_association.switch_association: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range]
module.leaf103.aci_switch_association.switch_association: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf/leaves-terrafrom-103_LfProf-typ-range]
module.leaf101_102.aci_node_block.check["102"]: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range/nodeblk-102]
module.leaf101_102.aci_node_block.check["101"]: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range/nodeblk-101]
module.leaf103.aci_node_block.check["103"]: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf/leaves-terrafrom-103_LfProf-typ-range/nodeblk-103]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
M14-NiravK:test_leaf_prof nirav.katarmal$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.leaf101_102.aci_leaf_interface_profile.interface_profile: Refreshing state... [id=uni/infra/accportprof-101-102]
module.leaf103.aci_leaf_interface_profile.interface_profile: Refreshing state... [id=uni/infra/accportprof-103]
module.leaf103.aci_leaf_profile.leaf_profile: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf]
module.leaf101_102.aci_leaf_profile.leaf_profile: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf]
module.leaf103.aci_switch_association.switch_association: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf/leaves-terrafrom-103_LfProf-typ-range]
module.leaf101_102.aci_switch_association.switch_association: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range]
module.leaf103.aci_node_block.check["103"]: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf/leaves-terrafrom-103_LfProf-typ-range/nodeblk-103]
module.leaf101_102.aci_node_block.check["102"]: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range/nodeblk-102]
module.leaf101_102.aci_node_block.check["101"]: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range/nodeblk-101]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
M14-NiravK:test_leaf_prof nirav.katarmal$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.leaf101_102.aci_leaf_interface_profile.interface_profile: Refreshing state... [id=uni/infra/accportprof-101-102]
module.leaf103.aci_leaf_interface_profile.interface_profile: Refreshing state... [id=uni/infra/accportprof-103]
module.leaf103.aci_leaf_profile.leaf_profile: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf]
module.leaf101_102.aci_leaf_profile.leaf_profile: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf]
module.leaf103.aci_switch_association.switch_association: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf/leaves-terrafrom-103_LfProf-typ-range]
module.leaf103.aci_node_block.check["103"]: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf/leaves-terrafrom-103_LfProf-typ-range/nodeblk-103]
module.leaf101_102.aci_switch_association.switch_association: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range]
module.leaf101_102.aci_node_block.check["102"]: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range/nodeblk-102]
module.leaf101_102.aci_node_block.check["101"]: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range/nodeblk-101]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
M14-NiravK:test_leaf_prof nirav.katarmal$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.leaf103.aci_leaf_interface_profile.interface_profile: Refreshing state... [id=uni/infra/accportprof-103]
module.leaf101_102.aci_leaf_interface_profile.interface_profile: Refreshing state... [id=uni/infra/accportprof-101-102]
module.leaf103.aci_leaf_profile.leaf_profile: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf]
module.leaf101_102.aci_leaf_profile.leaf_profile: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf]
module.leaf103.aci_switch_association.switch_association: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf/leaves-terrafrom-103_LfProf-typ-range]
module.leaf101_102.aci_switch_association.switch_association: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range]
module.leaf103.aci_node_block.check["103"]: Refreshing state... [id=uni/infra/nprof-terrafrom-103_LfProf/leaves-terrafrom-103_LfProf-typ-range/nodeblk-103]
module.leaf101_102.aci_node_block.check["102"]: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range/nodeblk-102]
module.leaf101_102.aci_node_block.check["101"]: Refreshing state... [id=uni/infra/nprof-terrafrom-101-102_LfProf/leaves-terrafrom-101-102_LfProf-typ-range/nodeblk-101]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
M14-NiravK:test_leaf_prof nirav.katarmal$ 
```



I would be happy to get on a call and troubleshoot more on this issue. Let me know if you need any help from my end.